[
    {
        "db_id": "common",
        "instruction": "",
        "input": "找所有name属性值大于或等于'Peter'的节点，并返回这些节点的name 和 born属性值。",
        "output": "MATCH (a) WHERE a.name >= 'Peter' RETURN a.name, a.born",
        "history": []
    },
    {
        "db_id": "common",
        "instruction": "",
        "input": "返回名字是Carrie-Anne Moss的节点的信息是什么？",
        "output": "MATCH (n {name: 'Carrie-Anne Moss'}) RETURN n",
        "history": []
    },
    {
        "db_id": "common",
        "instruction": "",
        "input": "出生于1967年或名字是Meg Ryan的人有哪些？",
        "output": "MATCH (n {born: 1967}),(nm {name: \"Meg Ryan\"}) RETURN n",
        "history": []
    },
    {
        "db_id": "common",
        "instruction": "",
        "input": "查找数据库中出演《黑客帝国》的演员。",
        "output": "MATCH (matrix:movie {title: 'The Matrix'})<-[:acted_in]-(actor) RETURN actor.name",
        "history": []
    },
    {
        "db_id": "common",
        "instruction": "",
        "input": "查找数据库中查询Laurence Fishburne出演的电影。这些电影的导演都是谁？",
        "output": "MATCH (laurence {name: 'Laurence Fishburne'})-[:acted_in]->(movie)<-[:directed]-(director) RETURN movie.title, director.name",
        "history": []
    },
    {
        "db_id": "common",
        "instruction": "",
        "input": "查找数据库中带白色腰带的人。他们的名字、年龄和腰带颜色分别是什么？",
        "output": "MATCH (n) WHERE n.belt = 'white' RETURN n.name, n.age, n.belt",
        "history": []
    },
    {
        "db_id": "common",
        "instruction": "",
        "input": "在图中查找名字是Peter但没有腰带的人。他们的年龄是多少？",
        "output": "MATCH (person) WHERE person.name = 'Peter' AND person.belt IS NULL RETURN person.name, person.age, person.belt",
        "history": []
    },
    {
        "db_id": "common",
        "instruction": "",
        "input": "查找图数据库中名字在Andres和Tobias之间的人。他们的出生年份是多少？",
        "output": "MATCH (a) WHERE a.name > 'Andres' AND a.name < 'Tobias' RETURN a.name, a.born",
        "history": []
    },
    {
        "db_id": "common",
        "instruction": "",
        "input": "查询跳过前3个人，返回后面的人的名字。",
        "output": "MATCH (n:person) RETURN n.name ORDER BY n.name SKIP 3",
        "history": []
    },
    {
        "db_id": "the_three_body",
        "instruction": "",
        "input": "查询姓名为\"量子号\",介绍为\"炮灰\"的组织u具有组织和计划间的关系的计划有哪些?返回m节点的name属性值,边r",
        "output": "MATCH (u:organization{name:\"量子号\",introduce:\"炮灰\"})-[r:organization_plan]->(m:plan) RETURN m.name,r",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "在图中查找与登录用户名为\"Stewart\"的用户p有关的电影有哪些?返回子图",
        "output": "MATCH (p:user{id:\"399\",login:\"Stewart\"})-[e]-(neighbor:movie) RETURN p,e,neighbor",
        "history": []
    },
    {
        "db_id": "the_three_body",
        "instruction": "",
        "input": "获得与名为\"神迹计划\"的计划p有关的组织有哪些?返回对应的计划,e,组织",
        "output": "MATCH (p:plan{name:\"神迹计划\"})-[e]-(neighbor:organization) RETURN p,e,neighbor",
        "history": []
    },
    {
        "db_id": "the_three_body",
        "instruction": "",
        "input": "获得名称为\"叶哲泰\",介绍为\"物理学教授,在文革中因为坚持真理被学生打死\"的人相关的计划有哪些?返回m节点的name属性值,边r",
        "output": "MATCH (u:person{name:\"叶哲泰\",introduce:\"物理学教授,在文革中因为坚持真理被学生打死\"})-[r:person_plan]->(m:plan) RETURN DISTINCT m.name,r",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "在图中查找流派n,返回n节点的name属性值,n节点的name属性值,同时按照节点的name属性升序排序",
        "output": "MATCH (n:genre) RETURN n.name,n.name ORDER BY n.name",
        "history": []
    },
    {
        "db_id": "the_three_body",
        "instruction": "",
        "input": "从数据库中查找姓名为\"威慑纪元\",时间为\"公元2208年-2270年\"的时间u具有时间关系的时间有哪些?返回m节点的name属性值,边r",
        "output": "MATCH (u:time{name:\"威慑纪元\",time:\"公元2208年-2270年\"})-[r:time_time]->(m:time) RETURN m.name,r",
        "history": []
    },
    {
        "db_id": "the_three_body",
        "instruction": "",
        "input": "从数据库中查找与名字为\"关一帆\"的人p有关的人有哪些?返回对应的人,e,人",
        "output": "MATCH (p:person{name:\"关一帆\"})-[e]-(neighbor:person) RETURN p,e,neighbor",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "获得流派id是\"610\"的电影有哪些?返回a节点,m节点",
        "output": "MATCH (m:genre{id:\"610\"})<-[:has_genre]-(a:movie) RETURN a,m",
        "history": []
    },
    {
        "db_id": "the_three_body",
        "instruction": "",
        "input": "找到\"掩体计划\"的计划m有关的人有哪些?返回节点a,节点m",
        "output": "MATCH (m:plan{name:\"掩体计划\"})<-[:person_plan]-(a:person) RETURN a,m",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "查找数据库中的关键字n,返回n节点的id属性值,n节点的name属性值,同时按照节点的id属性排序",
        "output": "MATCH (n:keyword) RETURN n.id,n.name ORDER BY keyword.id",
        "history": []
    },
    {
        "db_id": "the_three_body",
        "instruction": "",
        "input": "在图中查找的时间n,返回n节点的important_events属性值,n节点的name属性值,同时按照节点的important_events属性升序排序",
        "output": "MATCH (n:time) RETURN DISTINCT n.important_events,n.name ORDER BY n.important_events",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "从数据库中查找名称为\"Chiwetel Ejiofor\",出生年份为\"1977\"的人u出版的电影有哪些?返回m节点的tagline属性值,边r",
        "output": "MATCH (u:person{name:\"Chiwetel Ejiofor\",born:\"1977\"})-[r:produce]->(m:movie) RETURN m.tagline,r",
        "history": []
    },
    {
        "db_id": "the_three_body",
        "instruction": "",
        "input": "查找图数据库中姓名为\"二向箔\"的组织u具有组织间的关系的组织有哪些?返回m节点的introduce属性值,边r",
        "output": "MATCH (u:organization{name:\"二向箔\"})-[r:organization_organization]->(m:organization) RETURN m.introduce,r",
        "history": []
    },
    {
        "db_id": "the_three_body",
        "instruction": "",
        "input": "查找数据库中节点u人\"智子\"人物间关系有哪些?返回有关节点的introduce属性值,边r",
        "output": "MATCH (u:person{name:\"智子\"})-[r:person_person]->(m:person) RETURN m.introduce,r",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "以可选的方式从数据库中查找与标题为\"The Avengers\"的电影p有关的人有哪些?返回对应的电影,e,人",
        "output": "OPTIONAL MATCH (p:movie{id:\"2055\",title:\"The Avengers\"})-[e]-(neighbor:person) RETURN p,e,neighbor",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "在图中查找与姓名为\"Talia Shire\"的人p有关的电影有哪些?返回子图",
        "output": "MATCH (p:person{id:\"482\",name:\"Talia Shire\"})-[e]-(neighbor:movie) RETURN p,e,neighbor",
        "history": []
    },
    {
        "db_id": "finbench",
        "instruction": "",
        "input": "给定一个src账户260083977992279253，在startTime1627020616747=和endTime=1669690342640之间的特定时间范围内，找到从src到dst的所有金额超过阈值的转出（edge），返回转出次数和金额总和。",
        "output": "MATCH (n:Account{id:260083977992279253}) WITH n MATCH (n)-[e:transfer]->(m:Account) WHERE e.amount > 0.0 AND e.timestamp > 1627020616747 AND e.timestamp < 1669690342640 WITH m.id as dstId, count(e) as numEdges, sum(e.amount) as sumAmount RETURN dstId, numEdges, round(sumAmount * 1000) / 1000 as sumAmount ORDER BY sumAmount DESC, dstId ASC",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "查找图数据库中与id为\"2239\"的人p有关的电影有哪些?返回子图",
        "output": "MATCH (p:person{id:\"2239\"})-[e]-(neighbor:movie) RETURN p,e,neighbor",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "在图中查找给标签为\"Meet The Original Force Of Nature\"的电影m打分的用户有哪些?返回a节点,m节点",
        "output": "MATCH (m:movie{tagline:\"Meet The Original Force Of Nature\"})<-[:rate]-(a:user) RETURN a,m",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "从数据库中查找与标签为\"It was the greatest art heist in history\"的电影p有关的关键字有哪些?返回子图",
        "output": "MATCH (p:movie{tagline:\"It was the greatest art heist in history\"})-[e]-(neighbor:keyword) RETURN p,e,neighbor",
        "history": []
    },
    {
        "db_id": "finbench",
        "instruction": "",
        "input": "查找账户4779452526250437773，在startTime1627020616747=和endTime=1669690342640之间的时间范围内，其他账户向该账户转入金额超过100的转账记录。返回转入的数量和金额总和。",
        "output": "MATCH (n:Account{id:4779452526250437773})<-[e:transfer]-(m:Account) WHERE e.amount > 100.0 AND e.timestamp > 1627020616747 AND e.timestamp < 1669690342640 WITH m.id as srcId, count(e) as numEdges, sum(e.amount) as sumAmount RETURN srcId, numEdges, round(sumAmount * 1000) / 1000 as sumAmount ORDER BY sumAmount DESC, srcId ASC",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "查找图数据库中与出生日期为\"1943\"的人p有关的电影有哪些?返回相应的节点和关系",
        "output": "MATCH (p:person{id:\"483\",name:\"Gianni Russo\",born:\"1943\"})-[e]-(neighbor:movie) RETURN p,e,neighbor",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "查找图数据库中的用户n,返回n节点的id属性值,n节点的id属性值,按照节点的id属性升序排列返回的结果",
        "output": "MATCH (n:user) RETURN n.id,n.id ORDER BY user.id",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "以可选的方式查找数据库中的电影n,返回n节点的title属性值,n节点的id属性值,同时按照节点的title属性升序排序",
        "output": "OPTIONAL MATCH (n:movie) RETURN n.title,n.id ORDER BY movie.title",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "找到有关键字id为\"3388\"的关键字模板m的电影有哪些?返回a节点,m节点",
        "output": "MATCH (m:keyword{id:\"3388\"})<-[:has_keyword]-(a:movie) RETURN a,m",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "查找数据库中与名字为\"Paul Norell\"的人p有关的电影有哪些?返回对应的人,e,电影",
        "output": "MATCH (p:person{id:\"660\",name:\"Paul Norell\"})-[e]-(neighbor:movie) RETURN p,e,neighbor",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "从数据库中查找与id为\"610\"的流派p有关的电影有哪些?返回相应的节点和关系",
        "output": "MATCH (p:genre{id:\"610\"})-[e]-(neighbor:movie) RETURN p,e,neighbor",
        "history": []
    },
    {
        "db_id": "the_three_body",
        "instruction": "",
        "input": "从数据库中查找的计划n,返回n节点的content属性值,n节点的content属性值,同时按照节点的content属性降序排序",
        "output": "MATCH (n:plan) RETURN n.content,n.content ORDER BY n.content DESC",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "查询谁在电影Forrest Gump中扮演了什么角色，返回人的名字和扮演的角色。",
        "output": "MATCH (m:movie {title: 'Forrest Gump'})<-[r:acted_in]-(a:person) RETURN a.name,r.role",
        "history": []
    },
    {
        "db_id": "finbench",
        "instruction": "",
        "input": "首先查找所有向src账户id是243478878511713854转过账的中间账户m，然后找到m的转账对象中是黑户的账号dst，且src和dst账号id不同，以上转账记录时间在1627020616747到1669690342640范围内，返回去重后的dst账号id并排序。",
        "output": "MATCH (src:Account{id:243478878511713854})<-[e1:transfer]-(m:Account)-[e2:transfer]->(dst:Account) WHERE dst.isBlocked = true AND src.id <> dst.id AND e1.timestamp > 1627020616747 AND e1.timestamp < 1669690342640 AND e2.timestamp > 1627020616747 AND e2.timestamp < 1669690342640 RETURN DISTINCT dst.id as dstId ORDER BY dstId ASC",
        "history": []
    },
    {
        "db_id": "the_three_body",
        "instruction": "",
        "input": "查找图数据库中与姓名为\"PDC\"的组织p有关的计划有哪些?返回对应的组织,e,计划",
        "output": "MATCH (p:organization{name:\"PDC\"})-[e]-(neighbor:plan) RETURN p,e,neighbor",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "获得与标签为\"The extraordinary true story of Solomon Northup\"的电影p有关的用户有哪些?返回相应的节点和关系,跳过前9条数据",
        "output": "MATCH (p:movie{id:\"1693\",title:\"12 Years a Slave\",tagline:\"The extraordinary true story of Solomon Northup\"})-[e]-(neighbor:user) RETURN p,e,neighbor SKIP 9",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "查找图数据库中导演id为\"1\"的电影m的人有哪些?返回a节点,m节点",
        "output": "MATCH (m:movie{id:\"1\"})<-[:directed]-(a:person) RETURN a,m",
        "history": []
    },
    {
        "db_id": "the_three_body",
        "instruction": "",
        "input": "查找图数据库中与名字为\"PIA\"的组织p有关的人有哪些?返回子图",
        "output": "MATCH (p:organization{name:\"PIA\"})-[e]-(neighbor:person) RETURN DISTINCT p,e,neighbor",
        "history": []
    },
    {
        "db_id": "the_three_body",
        "instruction": "",
        "input": "在图中查找与名为\"雾伞计划\"的计划p有关的人有哪些?返回对应的计划,e,人",
        "output": "MATCH (p:plan{name:\"雾伞计划\"})-[e]-(neighbor:person) RETURN p,e,neighbor",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "查找图数据库中名为\"Pat Morita\"的人u写的电影有哪些?返回m节点的tagline属性值和连接关系。",
        "output": "MATCH (u:person{name:\"Pat Morita\"})-[r:write]->(m:movie) RETURN m.tagline,r",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "查询与标题为\"The Monuments Men\"的电影p有关的人有哪些?返回子图",
        "output": "MATCH (p:movie{id:\"1356\",title:\"The Monuments Men\"})-[e]-(neighbor:person) RETURN p,e,neighbor",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "以可选的方式找到登录用户名为\"Jacob\"的用户u打分的电影有哪些?返回m节点的tagline属性值,r边",
        "output": "OPTIONAL MATCH (u:user{login:\"Jacob\"})-[r:rate]->(m:movie) RETURN m.tagline,r",
        "history": []
    },
    {
        "db_id": "finbench",
        "instruction": "",
        "input": "根据账户id4817170722885471951，找到1627020616747-1669690342640时间段内的所有转入和转出关系，返回转入和转出各自的总金额和最大金额，如果转入或转出边不存在，则返回-1作为最大金额值。",
        "output": "MATCH (n:Account{id:%d}) WITH n OPTIONAL MATCH (n)-[e:transfer]->(m:Account) WHERE e.timestamp > 1627020616747 AND e.timestamp < 1669690342640 WITH n, sum(e.amount) as sumEdge1Amount, max(e.amount) as maxEdge1Amount, count(e) as numEdge1 OPTIONAL MATCH (n)<-[e:transfer]-(m:Account) WHERE e.timestamp > 1627020616747 AND e.timestamp < 1669690342640 WITH sumEdge1Amount, maxEdge1Amount, numEdge1, sum(e.amount) as sumEdge2Amount, max(e.amount) as maxEdge2Amount, count(e) as numEdge2 RETURN round(sumEdge1Amount * 1000) / 1000 as sumEdge1Amount, CASE WHEN maxEdge1Amount < 0 THEN -1 ELSE round(maxEdge1Amount * 1000) / 1000 END as maxEdge1Amount, numEdge1, round(sumEdge2Amount * 1000) / 1000 as sumEdge2Amount, CASE WHEN maxEdge2Amount < 0 THEN -1 ELSE round(maxEdge2Amount * 1000) / 1000 END as maxEdge2Amount, numEdge2",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "从数据库中查找与名字为\"motion capture\"的关键字p有关的电影有哪些?返回子图",
        "output": "MATCH (p:keyword{id:\"2587\",name:\"motion capture\"})-[e]-(neighbor:movie) RETURN p,e,neighbor",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "查找图数据库中与用户id为\"240\"的节点p有关的用户有哪些?返回相应的节点和关系",
        "output": "MATCH (p:user{id:\"240\"})-[e]-(neighbor:user) RETURN p,e,neighbor",
        "history": []
    },
    {
        "db_id": "the_three_body",
        "instruction": "",
        "input": "在图中查找与名字为\"PIA\"的组织p有关的组织有哪些?返回相应的节点和关系",
        "output": "MATCH (p:organization{name:\"PIA\"})-[e]-(neighbor:organization) RETURN p,e,neighbor",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "获得与id为\"39\"的用户p有关的用户有哪些?返回子图",
        "output": "MATCH (p:user{id:\"39\"})-[e]-(neighbor:user) RETURN p,e,neighbor",
        "history": []
    },
    {
        "db_id": "movie",
        "instruction": "",
        "input": "查找图数据库中名为\"David Wenham\"的人u导演的电影有哪些?返回m节点的tagline属性值和连接关系。",
        "output": "MATCH (u:person{name:\"David Wenham\"})-[r:directed]->(m:movie) RETURN m.tagline,r",
        "history": []
    },
    {
        "db_id": "the_three_body",
        "instruction": "",
        "input": "获得的人n,返回n节点的introduce属性值,n节点的introduce属性值,同时按照节点的introduce属性排序",
        "output": "MATCH (n:person) RETURN n.introduce,n.introduce ORDER BY n.introduce",
        "history": []
    }
]